#### Terraform Plan 📖

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.apis.google_project_service.artifactregistry will be created
  + resource "google_project_service" "artifactregistry" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "olist-data-portal"
      + service            = "artifactregistry.googleapis.com"
    }

  # module.apis.google_project_service.compute will be created
  + resource "google_project_service" "compute" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "olist-data-portal"
      + service            = "compute.googleapis.com"
    }

  # module.apis.google_project_service.container will be created
  + resource "google_project_service" "container" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "olist-data-portal"
      + service            = "container.googleapis.com"
    }

  # module.apis.google_project_service.iam will be created
  + resource "google_project_service" "iam" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "olist-data-portal"
      + service            = "iam.googleapis.com"
    }

  # module.apis.google_project_service.secretmanager will be created
  + resource "google_project_service" "secretmanager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "olist-data-portal"
      + service            = "secretmanager.googleapis.com"
    }

  # module.apis.google_project_service.servicenetworking will be created
  + resource "google_project_service" "servicenetworking" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "olist-data-portal"
      + service            = "servicenetworking.googleapis.com"
    }

  # module.apis.google_project_service.sqladmin will be created
  + resource "google_project_service" "sqladmin" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "olist-data-portal"
      + service            = "sqladmin.googleapis.com"
    }

  # module.artifact_registry.google_artifact_registry_repository.dagster will be created
  + resource "google_artifact_registry_repository" "dagster" {
      + create_time      = (known after apply)
      + description      = "Dagster container images"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "olist-data-portal"
      + repository_id    = "odp-dagster"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # module.cloudsql.data.google_secret_manager_secret_version.database_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "database_password" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + secret       = "odp-database-password"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.cloudsql.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = "10.3.0.0"
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "odp-cloudsql-ip"
      + network            = (known after apply)
      + prefix_length      = 24
      + project            = "olist-data-portal"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
      + terraform_labels   = (known after apply)
    }

  # module.cloudsql.google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "odp-cloudsql-ip",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.cloudsql.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "odp-cloudsql"
      + name            = "dagster"
      + project         = "olist-data-portal"
      + self_link       = (known after apply)
    }

  # module.cloudsql.google_sql_database_instance.main will be created
  + resource "google_sql_database_instance" "main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "odp-cloudsql"
      + private_ip_address             = (known after apply)
      + project                        = "olist-data-portal"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + edition               = "ENTERPRISE"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + enabled                        = false
              + start_time                     = "03:00"
              + transaction_log_retention_days = (known after apply)
            }

          + database_flags {
              + name  = "max_connections"
              + value = "100"
            }

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + private_network                               = (known after apply)
              + server_ca_mode                                = (known after apply)
              + ssl_mode                                      = (known after apply)
            }
        }
    }

  # module.cloudsql.google_sql_user.user will be created
  + resource "google_sql_user" "user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "odp-cloudsql"
      + name                    = "dagster"
      + password                = (sensitive value)
      + project                 = "olist-data-portal"
      + sql_server_user_details = (known after apply)
    }

  # module.cloudsql.time_sleep.wait_for_vpc_peering will be created
  + resource "time_sleep" "wait_for_vpc_peering" {
      + create_duration = "120s"
      + id              = (known after apply)
    }

  # module.gcs.google_storage_bucket.data_lake will be created
  + resource "google_storage_bucket" "data_lake" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "odp-data-lake"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # module.gke.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + enable_autopilot                         = true
      + enable_cilium_clusterwide_network_policy = false
      + enable_intranode_visibility              = true
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "asia-northeast1"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "odp-dagster-cluster"
      + network                                  = "odp-vpc"
      + networking_mode                          = "VPC_NATIVE"
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = (known after apply)
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "odp-subnet"
      + tpu_ipv4_cidr_block                      = (known after apply)

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services"
          + stack_type                    = "IPV4"
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = (known after apply)

          + cidr_blocks {
              + cidr_block   = "10.0.0.0/24"
              + display_name = "VPC Internal"
            }
          + cidr_blocks {
              + cidr_block   = "125.194.8.190/32"
              + display_name = "External Access"
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "172.16.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }

      + workload_identity_config {
          + workload_pool = "olist-data-portal.svc.id.goog"
        }
    }

  # module.iam.google_project_iam_member.execution_artifact_registry_reader will be created
  + resource "google_project_iam_member" "execution_artifact_registry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/artifactregistry.reader"
    }

  # module.iam.google_project_iam_member.execution_bigquery_editor will be created
  + resource "google_project_iam_member" "execution_bigquery_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/bigquery.dataEditor"
    }

  # module.iam.google_project_iam_member.execution_bigquery_job_user will be created
  + resource "google_project_iam_member" "execution_bigquery_job_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/bigquery.jobUser"
    }

  # module.iam.google_project_iam_member.execution_cloudsql_client will be created
  + resource "google_project_iam_member" "execution_cloudsql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/cloudsql.client"
    }

  # module.iam.google_project_iam_member.execution_local_artifact_registry_reader will be created
  + resource "google_project_iam_member" "execution_local_artifact_registry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/artifactregistry.reader"
    }

  # module.iam.google_project_iam_member.execution_local_bigquery_editor will be created
  + resource "google_project_iam_member" "execution_local_bigquery_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/bigquery.dataEditor"
    }

  # module.iam.google_project_iam_member.execution_local_bigquery_job_user will be created
  + resource "google_project_iam_member" "execution_local_bigquery_job_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/bigquery.jobUser"
    }

  # module.iam.google_project_iam_member.execution_local_cloudsql_client will be created
  + resource "google_project_iam_member" "execution_local_cloudsql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/cloudsql.client"
    }

  # module.iam.google_project_iam_member.execution_local_logging_writer will be created
  + resource "google_project_iam_member" "execution_local_logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/logging.logWriter"
    }

  # module.iam.google_project_iam_member.execution_local_secret_accessor will be created
  + resource "google_project_iam_member" "execution_local_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.iam.google_project_iam_member.execution_local_storage_admin will be created
  + resource "google_project_iam_member" "execution_local_storage_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/storage.objectAdmin"
    }

  # module.iam.google_project_iam_member.execution_logging_writer will be created
  + resource "google_project_iam_member" "execution_logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/logging.logWriter"
    }

  # module.iam.google_project_iam_member.execution_secret_accessor will be created
  + resource "google_project_iam_member" "execution_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.iam.google_project_iam_member.execution_storage_admin will be created
  + resource "google_project_iam_member" "execution_storage_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/storage.objectAdmin"
    }

  # module.iam.google_project_iam_member.gke_service_agent will be created
  + resource "google_project_iam_member" "gke_service_agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/container.serviceAgent"
    }

  # module.iam.google_project_iam_member.task_artifact_registry_reader will be created
  + resource "google_project_iam_member" "task_artifact_registry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/artifactregistry.reader"
    }

  # module.iam.google_project_iam_member.task_bigquery_editor will be created
  + resource "google_project_iam_member" "task_bigquery_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/bigquery.dataEditor"
    }

  # module.iam.google_project_iam_member.task_bigquery_job_user will be created
  + resource "google_project_iam_member" "task_bigquery_job_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/bigquery.jobUser"
    }

  # module.iam.google_project_iam_member.task_cloudsql_client will be created
  + resource "google_project_iam_member" "task_cloudsql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/cloudsql.client"
    }

  # module.iam.google_project_iam_member.task_local_bigquery_editor will be created
  + resource "google_project_iam_member" "task_local_bigquery_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/bigquery.dataEditor"
    }

  # module.iam.google_project_iam_member.task_local_bigquery_job_user will be created
  + resource "google_project_iam_member" "task_local_bigquery_job_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/bigquery.jobUser"
    }

  # module.iam.google_project_iam_member.task_local_cloudsql_client will be created
  + resource "google_project_iam_member" "task_local_cloudsql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/cloudsql.client"
    }

  # module.iam.google_project_iam_member.task_local_logging_writer will be created
  + resource "google_project_iam_member" "task_local_logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/logging.logWriter"
    }

  # module.iam.google_project_iam_member.task_local_secret_accessor will be created
  + resource "google_project_iam_member" "task_local_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.iam.google_project_iam_member.task_local_storage_admin will be created
  + resource "google_project_iam_member" "task_local_storage_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/storage.objectAdmin"
    }

  # module.iam.google_project_iam_member.task_logging_writer will be created
  + resource "google_project_iam_member" "task_logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/logging.logWriter"
    }

  # module.iam.google_project_iam_member.task_secret_accessor will be created
  + resource "google_project_iam_member" "task_secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.iam.google_project_iam_member.task_storage_admin will be created
  + resource "google_project_iam_member" "task_storage_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "olist-data-portal"
      + role    = "roles/storage.objectAdmin"
    }

  # module.iam.google_service_account.execution will be created
  + resource "google_service_account" "execution" {
      + account_id   = "odp-dagster-exec-sa-prd"
      + disabled     = false
      + display_name = "Dagster Execution Service Account (prd)"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "olist-data-portal"
      + unique_id    = (known after apply)
    }

  # module.iam.google_service_account.execution_local will be created
  + resource "google_service_account" "execution_local" {
      + account_id   = "odp-dagster-exec-local"
      + disabled     = false
      + display_name = "Dagster Execution Service Account (local)"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "olist-data-portal"
      + unique_id    = (known after apply)
    }

  # module.iam.google_service_account.gke will be created
  + resource "google_service_account" "gke" {
      + account_id   = "odp-gke-sa"
      + disabled     = false
      + display_name = "GKE Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "olist-data-portal"
      + unique_id    = (known after apply)
    }

  # module.iam.google_service_account.task will be created
  + resource "google_service_account" "task" {
      + account_id   = "odp-dagster-task-sa-prd"
      + disabled     = false
      + display_name = "Dagster Task Service Account (prd)"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "olist-data-portal"
      + unique_id    = (known after apply)
    }

  # module.iam.google_service_account.task_local will be created
  + resource "google_service_account" "task_local" {
      + account_id   = "odp-dagster-task-local"
      + disabled     = false
      + display_name = "Dagster Task Service Account (local)"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "olist-data-portal"
      + unique_id    = (known after apply)
    }

  # module.iam.google_service_account_iam_member.execution_workload_identity will be created
  + resource "google_service_account_iam_member" "execution_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:olist-data-portal.svc.id.goog[odp-dagster/dagster-execution-ksa]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.iam.google_service_account_iam_member.task_workload_identity will be created
  + resource "google_service_account_iam_member" "task_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:olist-data-portal.svc.id.goog[odp-dagster/dagster-task-ksa]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.kubernetes.data.google_secret_manager_secret_version.database_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "database_password" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + secret       = "odp-database-password"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.kubernetes.google_compute_global_address.dagster_ip will be created
  + resource "google_compute_global_address" "dagster_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + effective_labels   = (known after apply)
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "odp-dagster-ip"
      + prefix_length      = (known after apply)
      + project            = "olist-data-portal"
      + self_link          = (known after apply)
      + terraform_labels   = (known after apply)
    }

  # module.kubernetes.kubernetes_config_map.workspace will be created
  + resource "kubernetes_config_map" "workspace" {
      + data = {
          + "workspace.yaml" = <<-EOT
                load_from:
                  - grpc_server:
                      host: odp-dagster-user-code
                      port: 4000
                      location_name: "dagster_project"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "odp-workspace"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.kubernetes_deployment.daemon will be created
  + resource "kubernetes_deployment" "daemon" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dagster-daemon"
            }
          + name             = "odp-dagster-daemon"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "dagster-daemon"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "dagster-daemon"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = "dagster-task-ksa"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + args                       = (known after apply)
                      + image                      = "gcr.io/cloud-sql-connectors/cloud-sql-proxy:2.8.0"
                      + image_pull_policy          = (known after apply)
                      + name                       = "cloud-sql-proxy"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + resources {
                          + limits   = {
                              + "cpu"    = "100m"
                              + "memory" = "256Mi"
                            }
                          + requests = {
                              + "cpu"    = "50m"
                              + "memory" = "128Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = true
                          + privileged                 = false
                          + read_only_root_filesystem  = false
                          + run_as_non_root            = true
                        }
                    }
                  + container {
                      + command                    = [
                          + "dagster-daemon",
                          + "run",
                        ]
                      + image                      = "asia-northeast1-docker.pkg.dev/olist-data-portal/dagster/dagster:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "daemon"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name  = "DAGSTER_CURRENT_IMAGE"
                          + value = "asia-northeast1-docker.pkg.dev/olist-data-portal/dagster/dagster:latest"
                        }
                      + env {
                          + name  = "DAGSTER_POSTGRES_USER"
                          + value = "dagster"
                        }
                      + env {
                          + name = "DAGSTER_POSTGRES_PASSWORD"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "odp-database-password"
                                }
                            }
                        }
                      + env {
                          + name  = "DAGSTER_POSTGRES_HOST"
                          + value = "localhost"
                        }
                      + env {
                          + name  = "DAGSTER_POSTGRES_DB"
                          + value = "dagster"
                        }
                      + env {
                          + name  = "DAGSTER_USER_CODE_SERVICE"
                          + value = "odp-dagster-user-code:4000"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "500m"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "100m"
                              + "memory" = "256Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = "/opt/dagster/dagster_home/workspace.yaml"
                          + mount_propagation = "None"
                          + name              = "workspace"
                          + read_only         = false
                          + sub_path          = "workspace.yaml"
                        }
                    }

                  + volume {
                      + name = "workspace"

                      + config_map {
                          + default_mode = "0644"
                          + name         = "odp-workspace"
                        }
                    }
                }
            }
        }
    }

  # module.kubernetes.kubernetes_deployment.user_code will be created
  + resource "kubernetes_deployment" "user_code" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dagster-user-code"
            }
          + name             = "odp-dagster-user-code"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "dagster-user-code"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "dagster-user-code"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = "dagster-task-ksa"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "asia-northeast1-docker.pkg.dev/olist-data-portal/dagster/dagster-user-code:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "user-code"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name  = "DAGSTER_CURRENT_IMAGE"
                          + value = "asia-northeast1-docker.pkg.dev/olist-data-portal/dagster/dagster-user-code:latest"
                        }

                      + port {
                          + container_port = 4000
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "1000m"
                              + "memory" = "1Gi"
                            }
                          + requests = {
                              + "cpu"    = "100m"
                              + "memory" = "256Mi"
                            }
                        }
                    }
                }
            }
        }
    }

  # module.kubernetes.kubernetes_deployment.webserver will be created
  + resource "kubernetes_deployment" "webserver" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dagster-webserver"
            }
          + name             = "odp-dagster-webserver"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "dagster-webserver"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "dagster-webserver"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + scheduler_name                   = (known after apply)
                  + service_account_name             = "dagster-task-ksa"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + args                       = (known after apply)
                      + image                      = "gcr.io/cloud-sql-connectors/cloud-sql-proxy:2.8.0"
                      + image_pull_policy          = (known after apply)
                      + name                       = "cloud-sql-proxy"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + resources {
                          + limits   = {
                              + "cpu"    = "100m"
                              + "memory" = "256Mi"
                            }
                          + requests = {
                              + "cpu"    = "50m"
                              + "memory" = "128Mi"
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = true
                          + privileged                 = false
                          + read_only_root_filesystem  = false
                          + run_as_non_root            = true
                        }
                    }
                  + container {
                      + command                    = [
                          + "dagster-webserver",
                        ]
                      + image                      = "asia-northeast1-docker.pkg.dev/olist-data-portal/dagster/dagster:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "webserver"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env {
                          + name  = "DAGSTER_CURRENT_IMAGE"
                          + value = "asia-northeast1-docker.pkg.dev/olist-data-portal/dagster/dagster:latest"
                        }
                      + env {
                          + name  = "DAGSTER_POSTGRES_USER"
                          + value = "dagster"
                        }
                      + env {
                          + name = "DAGSTER_POSTGRES_PASSWORD"

                          + value_from {
                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "odp-database-password"
                                }
                            }
                        }
                      + env {
                          + name  = "DAGSTER_POSTGRES_HOST"
                          + value = "localhost"
                        }
                      + env {
                          + name  = "DAGSTER_POSTGRES_DB"
                          + value = "dagster"
                        }
                      + env {
                          + name  = "DAGSTER_USER_CODE_SERVICE"
                          + value = "odp-dagster-user-code:4000"
                        }
                      + env {
                          + name  = "DAGSTER_WEBSERVER_HOST"
                          + value = "0.0.0.0"
                        }

                      + liveness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 30
                          + period_seconds        = 30
                          + success_threshold     = 1
                          + timeout_seconds       = 5

                          + http_get {
                              + path   = "/"
                              + port   = "3000"
                              + scheme = "HTTP"
                            }
                        }

                      + port {
                          + container_port = 3000
                          + protocol       = "TCP"
                        }

                      + readiness_probe {
                          + failure_threshold     = 3
                          + initial_delay_seconds = 10
                          + period_seconds        = 10
                          + success_threshold     = 1
                          + timeout_seconds       = 5

                          + http_get {
                              + path   = "/"
                              + port   = "3000"
                              + scheme = "HTTP"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "500m"
                              + "memory" = "512Mi"
                            }
                          + requests = {
                              + "cpu"    = "100m"
                              + "memory" = "256Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = "/opt/dagster/dagster_home/workspace.yaml"
                          + mount_propagation = "None"
                          + name              = "workspace"
                          + read_only         = false
                          + sub_path          = "workspace.yaml"
                        }
                    }

                  + volume {
                      + name = "workspace"

                      + config_map {
                          + default_mode = "0644"
                          + name         = "odp-workspace"
                        }
                    }
                }
            }
        }
    }

  # module.kubernetes.kubernetes_ingress_v1.webserver will be created
  + resource "kubernetes_ingress_v1" "webserver" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.allow-http"            = "true"
              + "kubernetes.io/ingress.class"                 = "gce"
              + "kubernetes.io/ingress.global-static-ip-name" = "odp-dagster-ip"
            }
          + generation       = (known after apply)
          + name             = "odp-dagster-webserver-ingress"
          + namespace        = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "gce"

          + rule {
              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "odp-dagster-webserver"

                              + port {
                                  + number = 3000
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # module.kubernetes.kubernetes_namespace.dagster will be created
  + resource "kubernetes_namespace" "dagster" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "odp-dagster"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.kubernetes_secret.database_password will be created
  + resource "kubernetes_secret" "database_password" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "odp-database-password"
          + namespa
... (truncated)
```

*Pusher: @9714, Action: `pull_request`*